hour = 25
hours = [0,1,2,3,4,5,6,7,8,9,10,11,12,13,14,15,16,17,18,19,20,21,22,23]  # 0 - 23
# Если время между 7 утра и 11 утра, то доброе утро
# Если время между 12 дня и 17 дня, то добрый день
# Если время между 18 вчера и 22 вечера, то добрый вечер
# В остальных случаях доброй ночи

if 7 <= hour <= 11:
    print('Доброе утро')
elif 12 <= hour <= 17:
    print('Добрый день')
elif 18 <= hour <= 23:
    print('Добрый вечер')
elif hour not in hours:
    print('странное число')
else:
    print('Доброй ночи')